public/essays/04-36-nagasaki-1945/index.html
<!DOCTYPE html>
<html lang="en-us" data-theme="light">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>49 Tokyo 1945 - Against The Tide</title>
    
    
    <meta name="description" content="A series of fact-based civilian experience essays documenting U.S. military bombardments">
    <meta name="keywords" content="journalism, civilian, military, bombardment, essays, history">
    <meta name="author" content="TorchScribe">
    
    
    <meta property="og:type" content="article">
    <meta property="og:title" content="49 Tokyo 1945 - Against The Tide">
    <meta property="og:description" content="A series of fact-based civilian experience essays documenting U.S. military bombardments">
    <meta property="og:url" content="https://torchscribe.com/essays/04-36-nagasaki-1945/">
    
    
    <link href="https://fonts.googleapis.com/css2?family=Inter:wght@400;500;600;700&family=JetBrains+Mono:wght@400;700&display=swap" rel="stylesheet">
    <link rel="stylesheet" href="/css/style.css">
    
    
    <link rel="icon" type="image/svg+xml" href="/img/favicon.svg">
    <link rel="icon" type="image/png" href="/img/favicon.png">
    
    
</head>
<body>
    <div class="container">
        <header>
    <div class="logo">Against <span>The</span> Tide</div>
    <nav>
        
        
        <a href="/" >Home</a>
        
        <a href="/#essays" >Essays</a>
        
        <a href="/about/" >About</a>
        
        <button id="theme-toggle" aria-label="Toggle dark mode">
            <span class="theme-toggle-icon">◐</span>
        </button>
    </nav>
</header>

        <main>
            
<article class="essay-content markdown-content">
    <header class="essay-header">
        <h1>49 Tokyo 1945</h1>
        <div class="metadata">
            <p><strong>Location:</strong> </p>
            <p><strong>Year:</strong> </p>
        </div>
    </header>
    
    <div class="essay-article">
        
<p>
Masakatsu Obata, 99, was working at the Mitsubishi factory in Nagasaki when the atomic bomb detonated. After an air raid warning subsided, he resumed work, only to be engulfed by a sudden, intense light. The factory’s roof collapsed, and Obata sustained injuries. He sought shelter and encountered a coworker with severe burns, whose skin had melted off. The coworker died three days later.</p>
<p>
Obata’s family suffered immensely; his sister, who had gone to work that morning, never returned. His parents searched for her remains in vain. Obata himself experienced radiation sickness, including vomiting, hair loss, and bleeding gums. </p>
<p>
These personal tragedies reflect the broader suffering endured by Nagasaki’s residents following the bombing, which killed an estimated 39,000 to 80,000 people and leveled large portions of the city.</p>
<p>
<strong><strong>Source:</strong></strong> [TIME](<a href="https://time.com/after-the-bomb/)">https://time.com/after-the-bomb/)</a></p>
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
Sources
</h2>
</div>

    </div>
    
    
    
    <div class="essay-navigation">
        <a href="/#essays" class="back-to-essays">← Back to Essays</a>
    </div>
</article>

        </main>

        <footer>
    <p>© 2025 Against The Tide · All rights reserved</p>
    <p>Curated by TorchScribe</p>
</footer>
    </div>

    <script>
    
    document.addEventListener('DOMContentLoaded', () => {
        const themeToggle = document.getElementById('theme-toggle');
        
        themeToggle.addEventListener('click', () => {
            const currentTheme = document.documentElement.getAttribute('data-theme');
            const newTheme = currentTheme === 'dark' ? 'light' : 'dark';
            
            setTheme(newTheme);
        });
    });
    
    
    document.addEventListener('keydown', (e) => {
        
        if (e.altKey && e.key === 's') {
            e.preventDefault();
            window.location.href = '/#essays';
        }
        
        
        if (e.altKey && e.key === 'Home') {
            e.preventDefault();
            window.location.href = '/';
        }
        
        
        if (e.altKey && e.key === 'e') {
            e.preventDefault();
            window.location.href = '/#essays';
        }
        
        
        if (e.altKey && e.key === 'a') {
            e.preventDefault();
            window.location.href = '/about/';
        }
    });
</script>
</body>
</html>